In [1]:
import pandas as pd

In [2]:
df=pd.read_csv(r'C:\Users\RaghulRamesh\Downloads\companytest.csv')

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df.head(10)

    Company   Age  Salary
0  Infosys'  20.0     NaN
1       CTS  30.0     NaN
2  Infosys'  35.0  2300.0
3       CTS  40.0  3000.0
4   Infosys  23.0  4000.0
5       CTS   NaN  5000.0
6   Infosys   NaN  6000.0
7      CTS'  23.0  7000.0
8   Infosys  34.0  8000.0
9       TCS  45.0  9000.0

In [5]:
df.tail()

    Company   Age  Salary
25      CTS  23.0  8943.0
26  Infosys  34.0  8345.0
27      TCS  45.0  9284.0
28      TCS  23.0     NaN
29      TCS  35.0  2034.0

In [6]:
df.shape

(30, 3)

In [7]:
df.columns

Index(['Company', 'Age', 'Salary'], dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  27 non-null     object
 1   Age      26 non-null     float64
 2   Salary   23 non-null     float64
dtypes: float64(2), object(1)
memory usage: 848.0+ bytes

In [9]:
df.isnull().sum()

Company    3
Age        4
Salary     7
dtype: int64

In [10]:
df.shape

(30, 3)

In [11]:
df.duplicated().sum()

1

In [12]:
df.drop_duplicates(inplace=True)

In [13]:
df.shape

(29, 3)

In [14]:
df.columns

Index(['Company', 'Age', 'Salary'], dtype='object')

In [15]:
df['Company'].unique()

array(["Infosys'", 'CTS', 'Infosys', "CTS'", 'TCS', nan], dtype=object)

In [16]:
df['Company'].value_counts()

CTS         8
Infosys     8
TCS         7
Infosys'    2
CTS'        1
Name: Company, dtype: int64

In [17]:
df['Company'].replace({"Infosys'":"Infosys", "CTS'":"CTS"}, inplace=True)

In [42]:
df.columns

Index(['Company', 'Age', 'Salary'], dtype='object')

In [44]:
df.rename(columns={'Salary':'Amount'})

    Company    Age       Amount
0   Infosys  20.00  4923.086957
1       CTS  30.00  4923.086957
2   Infosys  35.00  2300.000000
3       CTS  40.00  3000.000000
4   Infosys  23.00  4000.000000
5       CTS  31.56  5000.000000
6   Infosys  31.56  6000.000000
7       CTS  23.00  7000.000000
8   Infosys  34.00  8000.000000
9       TCS  45.00  9000.000000
10      TCS  23.00  4923.086957
11      TCS  34.00  1089.000000
12      TCS  45.00  4923.086957
13      TCS  18.00  1234.000000
14  Infosys  40.00  3000.000000
15  Infosys  23.00  3000.000000
16      CTS  23.00  3030.000000
17  Infosys  34.00  5000.000000
18  Infosys  22.00  4923.086957
19      CTS  32.00  4923.086957
20  Infosys  37.00  3045.000000
21      CTS  50.00  3184.000000
22  Infosys  21.00  4824.000000
23      CTS  31.56  5835.000000
24  Infosys  31.56  7084.000000
25      CTS  23.00  8943.000000
26  Infosys  34.00  8345.000000
27      TCS  45.00  9284.000000
29      TCS  35.00  2034.000000

In [18]:
df['Company'].value_counts()

Infosys    10
CTS         9
TCS         7
Name: Company, dtype: int64

In [19]:
df['Company'].isnull().sum()

3

In [20]:
df['Company'].mode()[0]

'Infosys'

In [21]:
df['Company'].fillna(df['Company'].mode()[0], inplace=True)

In [22]:
df['Company']

0     Infosys
1         CTS
2     Infosys
3         CTS
4     Infosys
5         CTS
6     Infosys
7         CTS
8     Infosys
9         TCS
10        TCS
11        TCS
12        TCS
13        TCS
14    Infosys
15    Infosys
16        CTS
17    Infosys
18    Infosys
19        CTS
20    Infosys
21        CTS
22    Infosys
23        CTS
24    Infosys
25        CTS
26    Infosys
27        TCS
29        TCS
Name: Company, dtype: object

In [23]:
df.columns

Index(['Company', 'Age', 'Salary'], dtype='object')

In [24]:
df['Age'].isnull().sum()

4

In [25]:
df['Age'].min()

18.0

In [26]:
df['Age'].max()

50.0

In [27]:
df['Age'].mean()

31.56

In [28]:
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [29]:
df.columns

Index(['Company', 'Age', 'Salary'], dtype='object')

In [30]:
df['Salary'].isnull().sum()

6

In [31]:
df['Salary'].fillna(df['Salary'].mean(),inplace=True)

In [32]:
df

    Company    Age       Salary
0   Infosys  20.00  4923.086957
1       CTS  30.00  4923.086957
2   Infosys  35.00  2300.000000
3       CTS  40.00  3000.000000
4   Infosys  23.00  4000.000000
5       CTS  31.56  5000.000000
6   Infosys  31.56  6000.000000
7       CTS  23.00  7000.000000
8   Infosys  34.00  8000.000000
9       TCS  45.00  9000.000000
10      TCS  23.00  4923.086957
11      TCS  34.00  1089.000000
12      TCS  45.00  4923.086957
13      TCS  18.00  1234.000000
14  Infosys  40.00  3000.000000
15  Infosys  23.00  3000.000000
16      CTS  23.00  3030.000000
17  Infosys  34.00  5000.000000
18  Infosys  22.00  4923.086957
19      CTS  32.00  4923.086957
20  Infosys  37.00  3045.000000
21      CTS  50.00  3184.000000
22  Infosys  21.00  4824.000000
23      CTS  31.56  5835.000000
24  Infosys  31.56  7084.000000
25      CTS  23.00  8943.000000
26  Infosys  34.00  8345.000000
27      TCS  45.00  9284.000000
29      TCS  35.00  2034.000000

In [33]:
# loc , iloc

In [45]:
df.iloc[10:20,0:3]

    Company   Age       Salary
10      TCS  23.0  4923.086957
11      TCS  34.0  1089.000000
12      TCS  45.0  4923.086957
13      TCS  18.0  1234.000000
14  Infosys  40.0  3000.000000
15  Infosys  23.0  3000.000000
16      CTS  23.0  3030.000000
17  Infosys  34.0  5000.000000
18  Infosys  22.0  4923.086957
19      CTS  32.0  4923.086957

In [46]:
df.loc[10:20,['Salary','Company']]

         Salary  Company
10  4923.086957      TCS
11  1089.000000      TCS
12  4923.086957      TCS
13  1234.000000      TCS
14  3000.000000  Infosys
15  3000.000000  Infosys
16  3030.000000      CTS
17  5000.000000  Infosys
18  4923.086957  Infosys
19  4923.086957      CTS
20  3045.000000  Infosys

In [47]:
df[(df['Company']=='Infosys') & (df['Age'] <  35)]

    Company    Age       Salary
0   Infosys  20.00  4923.086957
4   Infosys  23.00  4000.000000
6   Infosys  31.56  6000.000000
8   Infosys  34.00  8000.000000
15  Infosys  23.00  3000.000000
17  Infosys  34.00  5000.000000
18  Infosys  22.00  4923.086957
22  Infosys  21.00  4824.000000
24  Infosys  31.56  7084.000000
26  Infosys  34.00  8345.000000

In [48]:
df[(df['Company']=='Infosys') | (df['Age']< 35)]

    Company    Age       Salary
0   Infosys  20.00  4923.086957
1       CTS  30.00  4923.086957
2   Infosys  35.00  2300.000000
4   Infosys  23.00  4000.000000
5       CTS  31.56  5000.000000
6   Infosys  31.56  6000.000000
7       CTS  23.00  7000.000000
8   Infosys  34.00  8000.000000
10      TCS  23.00  4923.086957
11      TCS  34.00  1089.000000
13      TCS  18.00  1234.000000
14  Infosys  40.00  3000.000000
15  Infosys  23.00  3000.000000
16      CTS  23.00  3030.000000
17  Infosys  34.00  5000.000000
18  Infosys  22.00  4923.086957
19      CTS  32.00  4923.086957
20  Infosys  37.00  3045.000000
22  Infosys  21.00  4824.000000
23      CTS  31.56  5835.000000
24  Infosys  31.56  7084.000000
25      CTS  23.00  8943.000000
26  Infosys  34.00  8345.000000

In [38]:
df.sort_values(by=['Salary'])

    Company    Age       Salary
11      TCS  34.00  1089.000000
13      TCS  18.00  1234.000000
29      TCS  35.00  2034.000000
2   Infosys  35.00  2300.000000
15  Infosys  23.00  3000.000000
14  Infosys  40.00  3000.000000
3       CTS  40.00  3000.000000
16      CTS  23.00  3030.000000
20  Infosys  37.00  3045.000000
21      CTS  50.00  3184.000000
4   Infosys  23.00  4000.000000
22  Infosys  21.00  4824.000000
0   Infosys  20.00  4923.086957
10      TCS  23.00  4923.086957
12      TCS  45.00  4923.086957
19      CTS  32.00  4923.086957
1       CTS  30.00  4923.086957
18  Infosys  22.00  4923.086957
17  Infosys  34.00  5000.000000
5       CTS  31.56  5000.000000
23      CTS  31.56  5835.000000
6   Infosys  31.56  6000.000000
7       CTS  23.00  7000.000000
24  Infosys  31.56  7084.000000
8   Infosys  34.00  8000.000000
26  Infosys  34.00  8345.000000
25      CTS  23.00  8943.000000
9       TCS  45.00  9000.000000
27      TCS  45.00  9284.000000

In [50]:
df.sort_values(by=['Salary','Age'])

    Company    Age       Salary
11      TCS  34.00  1089.000000
13      TCS  18.00  1234.000000
29      TCS  35.00  2034.000000
2   Infosys  35.00  2300.000000
15  Infosys  23.00  3000.000000
3       CTS  40.00  3000.000000
14  Infosys  40.00  3000.000000
16      CTS  23.00  3030.000000
20  Infosys  37.00  3045.000000
21      CTS  50.00  3184.000000
4   Infosys  23.00  4000.000000
22  Infosys  21.00  4824.000000
0   Infosys  20.00  4923.086957
18  Infosys  22.00  4923.086957
10      TCS  23.00  4923.086957
1       CTS  30.00  4923.086957
19      CTS  32.00  4923.086957
12      TCS  45.00  4923.086957
5       CTS  31.56  5000.000000
17  Infosys  34.00  5000.000000
23      CTS  31.56  5835.000000
6   Infosys  31.56  6000.000000
7       CTS  23.00  7000.000000
24  Infosys  31.56  7084.000000
8   Infosys  34.00  8000.000000
26  Infosys  34.00  8345.000000
25      CTS  23.00  8943.000000
9       TCS  45.00  9000.000000
27      TCS  45.00  9284.000000

In [40]:
df.groupby(by='Company')['Salary'].sum()

Company
CTS        45838.173913
Infosys    64444.173913
TCS        32487.173913
Name: Salary, dtype: float64

In [52]:
def find_category(sal):
    if sal >= 6000:
        return 'High Paid'
    elif sal >= 4000 and sal < 6000:
        return 'Medium Paid'
    else:
        return 'Less Paid'

In [55]:
df['Categgory']=df['Salary'].apply(find_category)

In [56]:
df.head()

   Company   Age       Salary    Categgory
0  Infosys  20.0  4923.086957  Medium Paid
1      CTS  30.0  4923.086957  Medium Paid
2  Infosys  35.0  2300.000000    Less Paid
3      CTS  40.0  3000.000000    Less Paid
4  Infosys  23.0  4000.000000  Medium Paid

In [58]:
df.drop(columns=['Salary'], inplace=True)

In [59]:
df.to_csv(r'D:\TPERSONAL\python_ericsson\company_final_2.csv', index=False)

In [60]:
df['Age'].min()

18.0

In [64]:
df=df.drop(df[df['Age']==18.0].index)

In [65]:
df['Age'].min()

20.0

In [66]:
pip install pandas

Requirement already satisfied: pandas in c:\users\raghulramesh\appdata\local\programs\python\python38\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\raghulramesh\appdata\local\programs\python\python38\lib\site-packages (from pandas) (1.22.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\raghulramesh\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\raghulramesh\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\raghulramesh\appdata\local\programs\python\python38\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.